cisco.org
#+TITLE: Cisco Configuration
#+AUTHOR: John Herrlin
#+EMAIL: jherrlin@gmail.com
#+DATE: <2017-01-26 Thu>
#+STARTUP: content

The configuration of the Cisco ASA and Catalyst is done
over serial RS232 connections to the devices.

The configuration is done from Emacs Org-mode with a discipline
called [[https://www.youtube.com/watch?v=dljNabciEGg&t=887s]["Literate DevOps"]].
The benefit that we get from this is that we can push
the configuration easy and in a documenting fashion.
We never have to enter a command manually on the devices.

The configuration is defined in org tables and we then run
a bash script that pushes the left column of the
config to the device. The bash is executed via Org-babel.

Here is an example of a table:

#+BEGIN_SRC org
  #+NAME: table-name
  | Command                              | Description         |
  |--------------------------------------+---------------------|
  | interface fa0/48                     | Select interface 48 |
  | switchport mode trunk                | Set mode as 'trunk' |
  | switchport Trunk encapsulation dot1q | Set encapsultation  |
  | exit                                 | Go back             |
#+END_SRC

Here is and example of the bash script that will execute the *Command* column rows:

#+BEGIN_SRC org
  ,#+BEGIN_SRC sh :var CMDS=table-name[1:*,0] :results drawer
    stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
    for i in "${CMDS[@]}"
    do
    echo -e -n "$i\r" > /dev/ttyUSB0
    done
  ,#+END_SRC
#+END_SRC

Look closely on the =table-name= that is both in the table and the =#+BEGIN_SRC= of the script.
What is happening here? Well, we have a table of commands and a description for each command.
We set a variable =table-name= that is an argument to the script.
As we dont wanna push the descriptions to the devices, and not
the first two lines. We tell the script
to only look in the first column on the 2 row, this is done with =[1:*,0]=.
We then iterate over all of the rows in that column and executes them in order.


* Cisco ASA 5510
** Find serial tty and attach 'echo'

Find where the USB is mounted. If your devices is not mounted
on */dev/ttyUSB0* you need to change this in the bash scripts.

#+BEGIN_SRC sh
dmesg | grep tty
dmesg | egrep --color 'serial|ttyS'
stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
#+END_SRC


** Reset the ASA
*** Reset from =rommon=

Rommon is a special boot mode.

Boot up and whatch the serial output.
Press <ESC> and you will enter =rommon=.

To reset the ASA:

#+BEGIN_SRC sh
  echo -e -n 'confreg 0x41\r'  > /dev/ttyUSB0
  echo -e -n 'confreg\r'  > /dev/ttyUSB0
  boot # Will boot into normal mode
#+END_SRC

*** Reset from normal boot

Resets the ASA to factory settings.

You need to be in =config f= mode to do this.

#+BEGIN_SRC sh
echo -e -n "config factory-default\r" > /dev/ttyUSB0
sleep 3
echo -e -n "wr mem\r" > /dev/ttyUSB0
#+END_SRC


** Basic configuration
*** Login

Make sure that the ASA have booted correctly.

#+BEGIN_SRC sh
  stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
  echo -e -n 'enable\r'  > /dev/ttyUSB0
  echo -e -n 'cisco\r'  > /dev/ttyUSB0  # Password, may be nothing
  echo -e -n 'conf t\r'  > /dev/ttyUSB0
#+END_SRC


