cisco.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-05 Sun 14:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cisco Configuration</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Herrlin" />
</head>
<body>
<div id="content">
<h1 class="title">Cisco Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4cb57e5">1. Cisco ASA 5510</a>
<ul>
<li><a href="#orge160fcd">1.1. Find serial tty and attach &rsquo;echo&rsquo;</a></li>
<li><a href="#orgfb363ab">1.2. Reset the ASA</a>
<ul>
<li><a href="#orgd6feaa0">1.2.1. Reset from <code>rommon</code></a></li>
<li><a href="#org776a092">1.2.2. Reset from normal boot</a></li>
</ul>
</li>
<li><a href="#org1a21296">1.3. Basic configuration</a>
<ul>
<li><a href="#orgf23bf93">1.3.1. Login</a></li>
<li><a href="#org516c374">1.3.2. Configure interfaces with VLANs</a></li>
<li><a href="#org4be924c">1.3.3. DHCP</a></li>
<li><a href="#org0aabbf2">1.3.4. NAT</a></li>
<li><a href="#org2451747">1.3.5. VPN</a></li>
<li><a href="#orgc451eca">1.3.6. Packet forwarding</a></li>
</ul>
</li>
<li><a href="#org1b405da">1.4. Show IP assigned to interfaces</a></li>
</ul>
</li>
<li><a href="#orgc305f0e">2. Cisco Catalyst 3500 Switch</a>
<ul>
<li><a href="#org00163d9">2.1. Set trunk port and configure ports</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The configuration of the Cisco ASA and Catalyst is done
over serial RS232 connections to the devices.
</p>

<p>
The configuration is done from Emacs Org-mode with a discipline
called <a href="https://www.youtube.com/watch?v=dljNabciEGg&amp;t=887s">&ldquo;Literate DevOps&rdquo;</a>.
The benefit that we get from this is that we can push
the configuration easy and in a documenting fashion.
We never have to enter a command manually on the devices.
</p>

<p>
The configuration is defined in org tables and we then run
a bash script that pushes the left column of the
config to the device. The bash is executed via Org-babel.
</p>

<p>
Here is an example of a table:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #7F9F7F;">#+NAME: table-name</span>
<span style="color: #9FC59F;">| Command                              | Description         |</span>
<span style="color: #9FC59F;">|--------------------------------------+---------------------|</span>
<span style="color: #9FC59F;">| interface fa0/48                     | Select interface 48 |</span>
<span style="color: #9FC59F;">| switchport mode trunk                | Set mode as 'trunk' |</span>
<span style="color: #9FC59F;">| switchport Trunk encapsulation dot1q | Set encapsultation  |</span>
<span style="color: #9FC59F;">| exit                                 | Go back             |</span>
</pre>
</div>

<p>
Here is and example of the bash script that will execute the <b>Command</b> column rows:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #7F9F7F;">#+BEGIN_SRC sh :var CMDS=table-name[1:*,0] :results drawer</span>
<span style="color: #b3b3b3;">  stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke</span>
<span style="color: #b3b3b3;">  </span><span style="color: #F0DFAF; font-weight: bold;">for</span><span style="color: #b3b3b3;"> i</span><span style="color: #F0DFAF; font-weight: bold;"> in</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">"${CMDS[@]}"</span>
<span style="color: #b3b3b3;">  </span><span style="color: #F0DFAF; font-weight: bold;">do</span>
<span style="color: #b3b3b3;">  </span><span style="color: #DCDCCC; font-weight: bold;">echo</span><span style="color: #b3b3b3;"> -e -n </span><span style="color: #CC9393;">"$i\r"</span><span style="color: #b3b3b3;"> &gt; /dev/ttyUSB0</span>
<span style="color: #b3b3b3;">  </span><span style="color: #F0DFAF; font-weight: bold;">done</span>
<span style="color: #7F9F7F;">#+END_SRC</span>
</pre>
</div>

<p>
Look closely on the <code>table-name</code> that is both in the table and the <code>#+BEGIN_SRC</code> of the script.
What is happening here? Well, we have a table of commands and a description for each command.
We set a variable <code>table-name</code> that is an argument to the script.
As we dont wanna push the descriptions to the devices, and not
the first two lines. We tell the script
to only look in the first column on the 2 row, this is done with <code>[1:*,0]</code>.
We then iterate over all of the rows in that column and executes them in order.
</p>


<div id="outline-container-org4cb57e5" class="outline-2">
<h2 id="org4cb57e5"><span class="section-number-2">1</span> Cisco ASA 5510</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge160fcd" class="outline-3">
<h3 id="orge160fcd"><span class="section-number-3">1.1</span> Find serial tty and attach &rsquo;echo&rsquo;</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Find where the USB is mounted. If your devices is not mounted
on <b>/dev/ttyUSB0</b> you need to change this in the bash scripts.
</p>

<div class="org-src-container">
<pre class="src src-sh">dmesg | grep tty
dmesg | egrep --color <span style="color: #CC9393;">'serial|ttyS'</span>
stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfb363ab" class="outline-3">
<h3 id="orgfb363ab"><span class="section-number-3">1.2</span> Reset the ASA</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgd6feaa0" class="outline-4">
<h4 id="orgd6feaa0"><span class="section-number-4">1.2.1</span> Reset from <code>rommon</code></h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Rommon is a special boot mode.
</p>

<p>
Boot up and whatch the serial output.
Press &lt;ESC&gt; and you will enter <code>rommon</code>.
</p>

<p>
To reset the ASA:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">'confreg 0x41\r'</span>  &gt; /dev/ttyUSB0
<span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">'confreg\r'</span>  &gt; /dev/ttyUSB0
boot <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Will boot into normal mode</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org776a092" class="outline-4">
<h4 id="org776a092"><span class="section-number-4">1.2.2</span> Reset from normal boot</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Resets the ASA to factory settings.
</p>

<p>
You need to be in <code>config f</code> mode to do this.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">"config factory-default\r"</span> &gt; /dev/ttyUSB0
sleep 3
<span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">"wr mem\r"</span> &gt; /dev/ttyUSB0
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org1a21296" class="outline-3">
<h3 id="org1a21296"><span class="section-number-3">1.3</span> Basic configuration</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgf23bf93" class="outline-4">
<h4 id="orgf23bf93"><span class="section-number-4">1.3.1</span> Login</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Make sure that the ASA have booted correctly.
</p>

<div class="org-src-container">
<pre class="src src-sh">stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
<span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">'enable\r'</span>  &gt; /dev/ttyUSB0
<span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">'cisco\r'</span>  &gt; /dev/ttyUSB0  <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Password, may be nothing</span>
<span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">'conf t\r'</span>  &gt; /dev/ttyUSB0
</pre>
</div>
</div>
</div>
