cisco.org
*** Configure interfaces with VLANs
     <<ciscoasabasicconfvlan>>

#+NAME: vlan-interface-conf-asa
| Command                            | Description                      |
|------------------------------------+----------------------------------|
| interface Ethernet0/0              | Select interface LNK SPD 0       |
| nameif external                    | Set a variable on that interface |
| ip add dhcp                        | Assign DHCP to 'external'        |
| no shut                            | Dont shut down 'external'        |
| exit                               | Go back                          |
|                                    |                                  |
| interface Ethernet0/1              | Select interface LNK SPD 1       |
| no shut                            | Dont shut down                   |
|                                    |                                  |
| interface Ethernet0/1.10           | VLAN 10 / internal               |
| vlan 10                            | Set VLAN 10                      |
| nameif internal                    | Name the interface               |
| security-level 100                 | Set security level               |
| ip address 10.0.1.1  255.255.255.0 | Assign static ip                 |
| no shut                            | Dont shut down                   |
| exit                               | Go back                          |
|                                    |                                  |
| interface Ethernet0/1.20           | VLAN 20 / dmz                    |
| vlan 20                            | Set VLAN 20                      |
| nameif dmz                         | Name the interface               |
| security-level 100                 | Set security level               |
| ip address 10.0.2.1  255.255.255.0 | Assign static ip                 |
| no shut                            | Dont shut down                   |
| exit                               | Go back                          |
|                                    |                                  |
| interface Ethernet0/1.30           | VLAN 30 / restricted             |
| vlan 30                            | Set VLAN 30                      |
| nameif restricted                  | Name the interface               |
| security-level 100                 | Set security level               |
| ip address 10.0.3.1  255.255.255.0 | Assign static ip                 |
| no shut                            | Dont shut down                   |
| exit                               | Go back                          |

#+BEGIN_SRC sh :var CMDS=vlan-interface-conf-asa[1:*,0] :results drawer :exports none
  stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
  for i in "${CMDS[@]}"
  do
      echo -e -n "$i\r" > /dev/ttyUSB0
  done
  echo -e -n "wr mem\r" > /dev/ttyUSB0
#+END_SRC


*** DHCP

    Configure DHCP and DNS with Googles DNS.

    #+NAME: dhcp-options
    | Command                                         | Description                              |
    |-------------------------------------------------+------------------------------------------|
    | dhcpd address 10.0.1.100-10.0.1.120 internal    | Set a specific DHCP range on 'internal'  |
    | dhcpd option 3 ip 10.0.1.1 interface internal   | Define a default gateway for 'internals' |
    | dhcpd dns 8.8.8.8 8.8.4.4                       |                                          |
    | dhcpd enable internal                           | Enable                                   |
    |                                                 |                                          |
    | dhcpd address 10.0.3.100-10.0.3.120 restricted  | Set a specific DHCP range on 'internal'  |
    | dhcpd option 3 ip 10.0.3.1 interface restricted | Define a default gateway for 'internals' |
    | dhcpd dns 8.8.8.8 8.8.4.4                       |                                          |
    | dhcpd enable restricted                         | Enable                                   |


    #+BEGIN_SRC sh :var CMDS=dhcp-options[1:*,0] :results drawer :exports none
      stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
      for i in "${CMDS[@]}"
      do
          echo -e -n "$i\r" > /dev/ttyUSB0
      done
      echo -e -n "wr mem\r" > /dev/ttyUSB0
    #+END_SRC


