cisco.html


<div id="outline-container-org516c374" class="outline-4">
<h4 id="org516c374"><span class="section-number-4">1.3.2</span> Configure interfaces with VLANs</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
<a id="org73df991"></a>
</p>

<table id="org5ee7a28" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">interface Ethernet0/0</td>
<td class="org-left">Select interface LNK SPD 0</td>
</tr>

<tr>
<td class="org-left">nameif external</td>
<td class="org-left">Set a variable on that interface</td>
</tr>

<tr>
<td class="org-left">ip add dhcp</td>
<td class="org-left">Assign DHCP to &rsquo;external&rsquo;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">Dont shut down &rsquo;external&rsquo;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface Ethernet0/1</td>
<td class="org-left">Select interface LNK SPD 1</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">Dont shut down</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface Ethernet0/1.10</td>
<td class="org-left">VLAN 10 / internal</td>
</tr>

<tr>
<td class="org-left">vlan 10</td>
<td class="org-left">Set VLAN 10</td>
</tr>

<tr>
<td class="org-left">nameif internal</td>
<td class="org-left">Name the interface</td>
</tr>

<tr>
<td class="org-left">security-level 100</td>
<td class="org-left">Set security level</td>
</tr>

<tr>
<td class="org-left">ip address 10.0.1.1  255.255.255.0</td>
<td class="org-left">Assign static ip</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">Dont shut down</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface Ethernet0/1.20</td>
<td class="org-left">VLAN 20 / dmz</td>
</tr>

<tr>
<td class="org-left">vlan 20</td>
<td class="org-left">Set VLAN 20</td>
</tr>

<tr>
<td class="org-left">nameif dmz</td>
<td class="org-left">Name the interface</td>
</tr>

<tr>
<td class="org-left">security-level 100</td>
<td class="org-left">Set security level</td>
</tr>

<tr>
<td class="org-left">ip address 10.0.2.1  255.255.255.0</td>
<td class="org-left">Assign static ip</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">Dont shut down</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface Ethernet0/1.30</td>
<td class="org-left">VLAN 30 / restricted</td>
</tr>

<tr>
<td class="org-left">vlan 30</td>
<td class="org-left">Set VLAN 30</td>
</tr>

<tr>
<td class="org-left">nameif restricted</td>
<td class="org-left">Name the interface</td>
</tr>

<tr>
<td class="org-left">security-level 100</td>
<td class="org-left">Set security level</td>
</tr>

<tr>
<td class="org-left">ip address 10.0.3.1  255.255.255.0</td>
<td class="org-left">Assign static ip</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">Dont shut down</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4be924c" class="outline-4">
<h4 id="org4be924c"><span class="section-number-4">1.3.3</span> DHCP</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Configure DHCP and DNS with Googles DNS.
</p>

<table id="org8ce8108" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dhcpd address 10.0.1.100-10.0.1.120 internal</td>
<td class="org-left">Set a specific DHCP range on &rsquo;internal&rsquo;</td>
</tr>

<tr>
<td class="org-left">dhcpd option 3 ip 10.0.1.1 interface internal</td>
<td class="org-left">Define a default gateway for &rsquo;internals&rsquo;</td>
</tr>

<tr>
<td class="org-left">dhcpd dns 8.8.8.8 8.8.4.4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dhcpd enable internal</td>
<td class="org-left">Enable</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dhcpd address 10.0.3.100-10.0.3.120 restricted</td>
<td class="org-left">Set a specific DHCP range on &rsquo;internal&rsquo;</td>
</tr>

<tr>
<td class="org-left">dhcpd option 3 ip 10.0.3.1 interface restricted</td>
<td class="org-left">Define a default gateway for &rsquo;internals&rsquo;</td>
</tr>

<tr>
<td class="org-left">dhcpd dns 8.8.8.8 8.8.4.4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">dhcpd enable restricted</td>
<td class="org-left">Enable</td>
</tr>
</tbody>
</table>
</div>
</div>
