cisco.org
*** NAT

    Configure NAT for both internal networks.
    Set up NAT and ACLs for services.

    #+NAME: set-nat-for-internal-to-external
    #+ATTR_LaTeX: :table align=|l|l|l|
    | Command                                                                                    | Description                    |
    |--------------------------------------------------------------------------------------------+--------------------------------|
    | object network internal-subnet                                                             | Create network object          |
    | subnet 10.0.1.0 255.255.255.0                                                              | Set subnet                     |
    | nat (internal,external) dynamic interface                                                  | Nat 'internal', 'external'     |
    | exit                                                                                       | Go back                        |
    |                                                                                            |                                |
    | object network dmz-subnet                                                                  | Create network object          |
    | subnet 10.0.2.0 255.255.255.0                                                              | Set subnet                     |
    | nat (dmz,external) dynamic interface                                                       | Nat 'dmz', 'external'          |
    | exit                                                                                       | Go back                        |
    |                                                                                            |                                |
    | object network restricted-subnet                                                           | Create network object          |
    | subnet 10.0.3.0 255.255.255.0                                                              | Set subnet                     |
    | nat (restricted,external) dynamic interface                                                | Nat 'restricted', 'external'   |
    | exit                                                                                       | Go back                        |
    |                                                                                            |                                |
    | same-security-traffic permit inter-interface                                               |                                |
    | route external 0.0.0.0 0.0.0.0 194.47.103.1                                                | Fix the routing                |
    |                                                                                            |                                |
    | object network dmz-http-server                                                             |                                |
    | host 10.0.2.10                                                                             |                                |
    | nat (dmz,external) static interface service tcp www www                                    |                                |
    | exit                                                                                       | Go back                        |
    |                                                                                            |                                |
    | access-list external_acl extended permit tcp host 155.4.14.29 object dmz-http-server eq 80   | Allow only access from Eduroam |
    | access-group external_acl in interface external                                            |                                |
    |                                                                                            |                                |
    | access-list HTTP-ONLY extended deny tcp 10.0.3.0 255.255.255.0 any eq 80                   |                                |
    | access-group HTTP-ONLY in interface external                                                                                       |                                |

    Any host can access the dmz http server
    =access-list external_acl extended permit tcp any object dmz-http-server eq 80=

    #+BEGIN_SRC sh :var CMDS=set-nat-for-internal-to-external[1:*,0] :results drawer :exports none
      stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
      for i in "${CMDS[@]}"
      do
          echo -e -n "$i\r" > /dev/ttyUSB0
      done
      echo -e -n "wr mem\r" > /dev/ttyUSB0
    #+END_SRC


*** VPN

I am not sure if this part is really working.

#+NAME: set-vpn-cisco-asa
| Command                                                                             | Description |
|-------------------------------------------------------------------------------------+-------------|
| object network VPN                                                                  |             |
| host 10.0.1.10                                                                      |             |
| object service L2TP                                                                 |             |
| service udp source eq 1701 destination eq 1701                                      |             |
| object service NATT                                                                 |             |
| service udp source eq 4500 destination eq 4500                                      |             |
| object-group service DM_INLINE_SERVICE_1                                            |             |
| service-object esp                                                                  |             |
| service-object object L2TP                                                          |             |
| service-object object NATT                                                          |             |
| service-object udp destination eq isakmp                                            |             |
| access-list vpn_acl extended permit object-group DM_INLINE_SERVICE_1 any object VPN |             |
|                                                                                     |             |
| nat (internal,external) source static VPN interface service NATT NATT               |             |
| nat (internal,external) source static VPN interface service L2TP L2TP               |             |
|                                                                                     |             |
| object network VPN                                                                  |             |
| nat (internal,external) static interface service udp isakmp isakmp                  |             |
|                                                                                     |             |
| access-group vpn_acl in interface external                                          |             |


#+BEGIN_SRC sh :var CMDS=set-vpn-cisco-asa[1:*,0] :results drawer :exports none
  stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
  for i in "${CMDS[@]}"
  do
      echo -e -n "$i\r" > /dev/ttyUSB0
  done
  echo -e -n "wr mem\r" > /dev/ttyUSB0
#+END_SRC


*** Packet forwarding

#+BEGIN_SRC sh
    stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
    array=(
        "class-map icmp-class"
        "match default-inspection-traffic"
        "exit"
        "policy-map icmp_policy"
        "class icmp-class"
        "inspect icmp"
        "exit"
        "service-policy icmp_policy interface external"
        "service-policy icmp_policy interface internal"
    )
    for i in "${array[@]}"
    do
        echo -e -n "$i\r" > /dev/ttyUSB0
    done
    echo -e -n "wr mem\r" > /dev/ttyUSB0
#+END_SRC


