cisco.html


<div id="outline-container-org0aabbf2" class="outline-4">
<h4 id="org0aabbf2"><span class="section-number-4">1.3.4</span> NAT</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Configure NAT for both internal networks.
Set up NAT and ACLs for services.
</p>

<table id="orgf02f4dd" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">object network internal-subnet</td>
<td class="org-left">Create network object</td>
</tr>

<tr>
<td class="org-left">subnet 10.0.1.0 255.255.255.0</td>
<td class="org-left">Set subnet</td>
</tr>

<tr>
<td class="org-left">nat (internal,external) dynamic interface</td>
<td class="org-left">Nat &rsquo;internal&rsquo;, &rsquo;external&rsquo;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object network dmz-subnet</td>
<td class="org-left">Create network object</td>
</tr>

<tr>
<td class="org-left">subnet 10.0.2.0 255.255.255.0</td>
<td class="org-left">Set subnet</td>
</tr>

<tr>
<td class="org-left">nat (dmz,external) dynamic interface</td>
<td class="org-left">Nat &rsquo;dmz&rsquo;, &rsquo;external&rsquo;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object network restricted-subnet</td>
<td class="org-left">Create network object</td>
</tr>

<tr>
<td class="org-left">subnet 10.0.3.0 255.255.255.0</td>
<td class="org-left">Set subnet</td>
</tr>

<tr>
<td class="org-left">nat (restricted,external) dynamic interface</td>
<td class="org-left">Nat &rsquo;restricted&rsquo;, &rsquo;external&rsquo;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">same-security-traffic permit inter-interface</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">route external 0.0.0.0 0.0.0.0 194.47.103.1</td>
<td class="org-left">Fix the routing</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object network dmz-http-server</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">host 10.0.2.10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nat (dmz,external) static interface service tcp www www</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">access-list external_acl extended permit tcp host 155.4.14.29 object dmz-http-server eq 80</td>
<td class="org-left">Allow only access from Eduroam</td>
</tr>

<tr>
<td class="org-left">access-group external_acl in interface external</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">access-list HTTP-ONLY extended deny tcp 10.0.3.0 255.255.255.0 any eq 80</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">access-group HTTP-ONLY in interface external</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Any host can access the dmz http server
<code>access-list external_acl extended permit tcp any object dmz-http-server eq 80</code>
</p>
</div>
</div>

<div id="outline-container-org2451747" class="outline-4">
<h4 id="org2451747"><span class="section-number-4">1.3.5</span> VPN</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
I am not sure if this part is really working.
</p>

<table id="org5aa4c69" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">object network VPN</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">host 10.0.1.10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object service L2TP</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">service udp source eq 1701 destination eq 1701</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object service NATT</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">service udp source eq 4500 destination eq 4500</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object-group service DM_INLINE_SERVICE_1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">service-object esp</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">service-object object L2TP</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">service-object object NATT</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">service-object udp destination eq isakmp</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">access-list vpn_acl extended permit object-group DM_INLINE_SERVICE_1 any object VPN</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nat (internal,external) source static VPN interface service NATT NATT</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nat (internal,external) source static VPN interface service L2TP L2TP</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">object network VPN</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">nat (internal,external) static interface service udp isakmp isakmp</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">access-group vpn_acl in interface external</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgc451eca" class="outline-4">
<h4 id="orgc451eca"><span class="section-number-4">1.3.6</span> Packet forwarding</h4>
<div class="outline-text-4" id="text-1-3-6">
<div class="org-src-container">
<pre class="src src-sh">stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
<span style="color: #DFAF8F;">array</span>=(
    <span style="color: #CC9393;">"class-map icmp-class"</span>
    <span style="color: #CC9393;">"match default-inspection-traffic"</span>
    <span style="color: #CC9393;">"exit"</span>
    <span style="color: #CC9393;">"policy-map icmp_policy"</span>
    <span style="color: #CC9393;">"class icmp-class"</span>
    <span style="color: #CC9393;">"inspect icmp"</span>
    <span style="color: #CC9393;">"exit"</span>
    <span style="color: #CC9393;">"service-policy icmp_policy interface external"</span>
    <span style="color: #CC9393;">"service-policy icmp_policy interface internal"</span>
)
<span style="color: #F0DFAF; font-weight: bold;">for</span> i<span style="color: #F0DFAF; font-weight: bold;"> in</span> <span style="color: #CC9393;">"${array[@]}"</span>
<span style="color: #F0DFAF; font-weight: bold;">do</span>
    <span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">"$i\r"</span> &gt; /dev/ttyUSB0
<span style="color: #F0DFAF; font-weight: bold;">done</span>
<span style="color: #DCDCCC; font-weight: bold;">echo</span> -e -n <span style="color: #CC9393;">"wr mem\r"</span> &gt; /dev/ttyUSB0
</pre>
</div>
</div>
</div>
</div>
