cisco.org
** Show IP assigned to interfaces

   Show IP and related configurations.

   #+NAME: show-ip-details
   | Command                         | Description       |
   |---------------------------------+-------------------|
   | show ip                         | Show IP           |
   |                                 |                   |
   | show interface ip brief         | Show more details |
   |                                 |                   |
   | show access list                |                   |
   |                                 |                   |
   | show running-config access-list |                   |
   |                                 |                   |
   | sh dhcpd binding                | Show DHCP Leases  |
   |                                 |                   |
   | ping 8.8.8.8                    | Healt test        |


   #+BEGIN_SRC sh :var CMDS=show-ip-details[1:*,0] :results drawer :exports none
     stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
     for i in "${CMDS[@]}"
     do
         echo -e -n "$i\r" > /dev/ttyUSB0
     done
   #+END_SRC


* Cisco Catalyst 3500 Switch

