cisco.html


<div id="outline-container-org1b405da" class="outline-3">
<h3 id="org1b405da"><span class="section-number-3">1.4</span> Show IP assigned to interfaces</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Show IP and related configurations.
</p>

<table id="org937d041" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">show ip</td>
<td class="org-left">Show IP</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">show interface ip brief</td>
<td class="org-left">Show more details</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">show access list</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">show running-config access-list</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">sh dhcpd binding</td>
<td class="org-left">Show DHCP Leases</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ping 8.8.8.8</td>
<td class="org-left">Healt test</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-orgc305f0e" class="outline-2">
<h2 id="orgc305f0e"><span class="section-number-2">2</span> Cisco Catalyst 3500 Switch</h2>
<div class="outline-text-2" id="text-2">
</div>
