cisco.org
** Set trunk port and configure ports

  Make sure you are in =conf t= mode.

  #+NAME: set-trunk-port-on-switch
  | Command                              | Description         |
  |--------------------------------------+---------------------|
  | interface fa0/48                     | Select interface 48 |
  | switchport mode trunk                | Set mode as 'trunk' |
  | switchport Trunk encapsulation dot1q | Set encapsultation  |
  | exit                                 | Go back             |
  |                                      |                     |
  |                                      | VLAN 10             |
  | interface vlan 10                    |                     |
  | no shut                              |                     |
  | interface fa0/1                      |                     |
  | switchport access vlan 10            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 10                    |                     |
  | no shut                              |                     |
  | interface fa0/3                      |                     |
  | switchport access vlan 10            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 10                    |                     |
  | no shut                              |                     |
  | interface fa0/5                      |                     |
  | switchport access vlan 10            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 10                    |                     |
  | no shut                              |                     |
  | interface fa0/7                      |                     |
  | switchport access vlan 10            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 10                    |                     |
  | no shut                              |                     |
  | interface fa0/9                      |                     |
  | switchport access vlan 10            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 10                    |                     |
  | no shut                              |                     |
  | interface fa0/11                     |                     |
  | switchport access vlan 10            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 10                    |                     |
  | no shut                              |                     |
  | interface fa0/13                     |                     |
  | switchport access vlan 10            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 10                    |                     |
  | no shut                              |                     |
  | interface fa0/15                     |                     |
  | switchport access vlan 10            |                     |
  | exit                                 |                     |
  |                                      |                     |
  |                                      | VLAN 20             |
  | interface vlan 20                    |                     |
  | no shut                              |                     |
  | interface fa0/17                     |                     |
  | switchport access vlan 20            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 20                    |                     |
  | no shut                              |                     |
  | interface fa0/19                     |                     |
  | switchport access vlan 20            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 20                    |                     |
  | no shut                              |                     |
  | interface fa0/21                     |                     |
  | switchport access vlan 20            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 20                    |                     |
  | no shut                              |                     |
  | interface fa0/23                     |                     |
  | switchport access vlan 20            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 20                    |                     |
  | no shut                              |                     |
  | interface fa0/25                     |                     |
  | switchport access vlan 20            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 20                    |                     |
  | no shut                              |                     |
  | interface fa0/27                     |                     |
  | switchport access vlan 20            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 20                    |                     |
  | no shut                              |                     |
  | interface fa0/29                     |                     |
  | switchport access vlan 20            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 20                    |                     |
  | no shut                              |                     |
  | interface fa0/31                     |                     |
  | switchport access vlan 20            |                     |
  | exit                                 |                     |
  |                                      |                     |
  |                                      |                     |
  |                                      | VLAN 30             |
  | interface vlan 30                    |                     |
  | no shut                              |                     |
  | interface fa0/33                     |                     |
  | switchport access vlan 30            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 30                    |                     |
  | no shut                              |                     |
  | interface fa0/35                     |                     |
  | switchport access vlan 30            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 30                    |                     |
  | no shut                              |                     |
  | interface fa0/37                     |                     |
  | switchport access vlan 30            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 30                    |                     |
  | no shut                              |                     |
  | interface fa0/39                     |                     |
  | switchport access vlan 30            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 30                    |                     |
  | no shut                              |                     |
  | interface fa0/41                     |                     |
  | switchport access vlan 30            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 30                    |                     |
  | no shut                              |                     |
  | interface fa0/43                     |                     |
  | switchport access vlan 30            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 30                    |                     |
  | no shut                              |                     |
  | interface fa0/45                     |                     |
  | switchport access vlan 30            |                     |
  | exit                                 |                     |
  |                                      |                     |
  | interface vlan 30                    |                     |
  | no shut                              |                     |
  | interface fa0/47                     |                     |
  | switchport access vlan 30            |                     |
  | exit                                 |                     |
  |                                      |                     |
  |                                      | Spanning            |
  | no spanning-tree vlan 10             |                     |
  | no spanning-tree vlan 20             |                     |
  | no spanning-tree vlan 30             |                     |


  #+BEGIN_SRC sh :var CMDS=set-trunk-port-on-switch[1:*,0] :results drawer :exports none
    stty -F /dev/ttyUSB0 9600 raw -echo -echoe -echok -echoctl -echoke
    for i in "${CMDS[@]}"
    do
    echo -e -n "$i\r" > /dev/ttyUSB0
    done
  #+END_SRC
