cisco.html
<div id="outline-container-org00163d9" class="outline-3">
<h3 id="org00163d9"><span class="section-number-3">2.1</span> Set trunk port and configure ports</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Make sure you are in <code>conf t</code> mode.
</p>

<table id="org88467c7" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">interface fa0/48</td>
<td class="org-left">Select interface 48</td>
</tr>

<tr>
<td class="org-left">switchport mode trunk</td>
<td class="org-left">Set mode as &rsquo;trunk&rsquo;</td>
</tr>

<tr>
<td class="org-left">switchport Trunk encapsulation dot1q</td>
<td class="org-left">Set encapsultation</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">Go back</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">VLAN 10</td>
</tr>

<tr>
<td class="org-left">interface vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/5</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/7</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/9</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/11</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/13</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/15</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">VLAN 20</td>
</tr>

<tr>
<td class="org-left">interface vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/17</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/19</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/21</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/23</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/25</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/27</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/29</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/31</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">VLAN 30</td>
</tr>

<tr>
<td class="org-left">interface vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/33</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/35</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/37</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/39</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/41</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/43</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/45</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no shut</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">interface fa0/47</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">switchport access vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">exit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Spanning</td>
</tr>

<tr>
<td class="org-left">no spanning-tree vlan 10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no spanning-tree vlan 20</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">no spanning-tree vlan 30</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-01-26 Thu 00:00</p>
<p class="author">Author: John Herrlin</p>
<p class="date">Created: 2019-05-05 Sun 14:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
